{
    "data": {
        "id": 9,
        "content": "<p><span style=\"font-size: large;\">Come in and try this browser-based sudoku game written in JavaScript. Compete with your friends and see who solves faster! There are over 150 levels marked with three different difficulty levels A through C, from the easiest to the impossible. Can you solve all of them? You can drag and drop numbers into the cells or type in using the click-enabled tiny keyboard. Notice you also get a limited number of cues if you get stucked. Feel free to pause at any time you want and come back again to solve these puzzles. Does the timer on the left make you stressed? Enjoy.</span></p><p><span style=\"font-size: large;\"><br></span></p><p><iframe height=\"720px\" width=\"100%\" src=\"https://phillipfeiding.github.io/sudoku/WebContent/sudoku.html\" scrolling=\"no\" frameborder=\"no\" allowtransparency=\"true\" allowfullscreen=\"true\" sandbox=\"allow-forms allow-pointer-lock allow-popups allow-same-origin allow-scripts allow-modals\"></iframe><br></p><h1 style=\"text-align: left;\">Repository Link</h1><p style=\"text-align: center;\"><a href=\"https://github.com/PhillipFeiDing/sudoku\" target=\"_blank\" style=\"font-size: large;\">Link to GitHub</a><br></p>",
        "time": 1536505200000,
        "exerpt": "Come in and try this browser-based sudoku game written in JavaScript. Compete with your friends and see who solves faster! There are over 150 levels marked with three different difficulty levels A through C, from the easiest to the impossible. Can you solve all of them? You can drag and drop numbers into the cells or type in using the click-enabled tiny keyboard. Notice you also get a limited number of cues if you get stucked. Feel free to pause at any time you want and come back again to solve these puzzles.",
        "tagList": [2, 4],
        "title": "JavaScript Sudoku Game",
        "imageURL": "https://github.com/PhillipFeiDing/myblog-resource/blob/master/blog-cover-image/sudoku.png?raw=true"
    },
    "errno": 0
}